Truehire/qa/load/login-load.yml
config:
  target: "{{ $processEnvironment.API_BASE_URL || 'http://127.0.0.1:5000/api' }}"
  processor: "./processors/token-processor.js"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 25
  payload:
    path: "../payloads/users.csv"
    fields: [email, password, role]
  ensure:
    thresholds:
      - http.response_time.p95: 800
      - http.response_time.p99: 1500
      - http.codes.5xx: 0
scenarios:
  - name: login
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            role: "{{ role }}"
          expect:
            - statusCode: 200