Truehire/qa/load/payment-load.yml
config:
  target: "{{ $processEnvironment.API_BASE_URL || 'http://127.0.0.1:5000/api' }}"
  processor: "./processors/token-processor.js"
  phases:
    - duration: 60
      arrivalRate: 2
      rampTo: 15
  payload:
    path: "../payloads/recruiters.csv"
    fields: [email, password, role]
  ensure:
    thresholds:
      - http.response_time.p95: 1500
      - http.codes.5xx: 0
scenarios:
  - name: premium order creation
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            role: "{{ role }}"
          capture:
            - json: "$.token"
              as: token
      - post:
          url: "/payments/create-premium-order"
          beforeRequest: "setBearerToken"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            planId: "premium-monthly"
      - get:
          url: "/payments/status"
          beforeRequest: "setBearerToken"
          headers:
            Authorization: "Bearer {{ token }}"